## Staging: elasticache
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`





```terraform
Plan: 1 to add, 0 to change, 0 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_metric_alarm.redis-elasticache-evictions-warning will be created
  + resource "aws_cloudwatch_metric_alarm" "redis-elasticache-evictions-warning" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:239043911459:alert-warning",
        ]
      + alarm_description                     = "Average Number of Evictions on Redis ElastiCache >= 1 connections during 1 minute"
      + alarm_name                            = "redis-elasticache-evictions-warning"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanOrEqualToThreshold"
      + dimensions                            = {
          + "CacheClusterId" = "notification-canada-ca-staging-cluster-cache"
        }
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + metric_name                           = "Evictions"
      + namespace                             = "AWS/ElastiCache"
      + period                                = 60
      + statistic                             = "Average"
      + tags_all                              = (known after apply)
      + threshold                             = 1
      + treat_missing_data                    = "missing"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-evictions-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-connection-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-high-db-memory-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.redis-elasticache-medium-cpu-warning"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_cluster.notification-cluster-cache"]
WARN - plan.json - main - Missing Common Tags: ["aws_elasticache_subnet_group.notification-canada-ca-cache-subnet"]

15 tests, 8 passed, 7 warnings, 0 failures, 0 exceptions

```

</details>
